name: "vae_encoder"
platform: "tensorrt_plan"
default_model_filename: "vae_encode.plan"
max_batch_size : 0
input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ -1, 3, -1, -1 ]
  }
]
output [
  {
    name: "latent"
    data_type: TYPE_FP32
    dims: [ -1, 4, -1, -1 ]
  }
]
